//	예제 모음01
#include	<stdio.h>

/*
int main(void)
{
	int a, b, c, d;
	int result;

	printf("첫 번째 계산할 값을 입력하세요 ==> ");
	scanf_s("%d", &a);
	printf("두 번째 계산할 값을 입력하세요 ==> ");
	scanf_s("%d", &b);
	printf("세 번째 계산할 값을 입력하세요 ==> ");
	scanf_s("%d", &c);
	printf("네 번째 계산할 값을 입력하세요 ==> ");
	scanf_s("%d", &d);

	result = a + b + c + d;
	printf("%d + %d + %d + %d = %d \n", a, b, c, d, result);
	
	return 0;
}
*/

//	예제 모음02
//	예제 모음03
//	예제 모음04
//	예제 모음05
//	예제 모음06
//	예제 모음07
//	예제 모음08
//	예제 모음09
//	예제 모음10
//	예제 모음11
//	예제 모음12
//	예제 모음13
//	예제 모음14
//	예제 모음15
//	예제 모음16
//	예제 모음17
//	예제 모음18
//	예제 모음19
//	예제 모음20
//	예제 모음21
//	예제 모음22
//	예제 모음23
//	예제 모음24
//	예제 모음25
//	예제 모음26
//	예제 모음27
//	예제 모음28
//	예제 모음29
//	예제 모음30
//	예제 모음31
//	예제 모음32
//	예제 모음33
//	예제 모음34
//	예제 모음35
//	예제 모음36
//	예제 모음37
//	예제 모음38
//	예제 모음39
//	예제 모음40